#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#

# Completions
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src
aloxaf/fzf-tab

# Completion styles
belak/zsh-utils path:completion/functions kind:autoload post:compstyle_zshzoo_setup

# Keybindings
daniellmiranda/zsh-utils path:editor # fork that doesn't force block cursor

# History
belak/zsh-utils path:history

# Utilities
zshzoo/macos conditional:is-macos
belak/zsh-utils path:utility
romkatv/zsh-bench kind:path kind:defer
ohmyzsh/ohmyzsh path:plugins/extract

# Other Fish-like features
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-autosuggestions kind:defer

# Misc.
paulirish/git-open kind:defer
dim-an/cod kind:defer
